/*
	File:		SlicesStrings.strings

	Contains:
	Copyright:	© 2007-2009 by Apple Inc., all rights reserved.
*/

//===========================================================================
// NOTE FOR LOCALIZERS:
// For any attributes overridden using the MDSlicesAttributeNameOverrides
// strings file, special care must be taken here. The KEY of the strings
// here will change from its english version to the name override.  For example:
//
// If MDSlicesAttributeNameOverrides.strings contains:
//		kMDItemTextContent = "TEXTCONTENT";
//
// Then replace any use of "Contents" (the english localization) in the KEYS
// of this file with the localization provided in MDSlicesAttributeNameOverrides.strings.
//
// In the above example, the localizer should change the text content localization below from:
//		"%[Contents]@ contains %@" = "%1$[Contents]@ contains %2$@";  // english version
//	to:
//		"%[TEXTCONTENT]@ contains %@" = "%1$[TEXTCONTENT]@ xxxxxx %2$@"; // localized version
//===========================================================================

/* Compound-type slices */
"%[Any]@ of the following are true" = "%1$[Alcuni]@ dei seguenti sono veri";
"%[All]@ of the following are true" = "%1$[Tutti]@ i seguenti sono veri";
"%[None]@ of the following are true" = "%1$[Nessuno]@ dei seguenti è vero";

/* Specific kind strings */
"%[Kind]@ is %[any]@" = "%1$[Tipo]@ è %2$[Qualsiasi]@";
"%[Kind]@ is %[applications]@" = "%1$[Tipo]@ è %2$[Applicazione]@";
"%[Kind]@ is %[documents]@" = "%1$[Tipo]@ è %2$[Documento]@";
"%[Kind]@ is %[folders]@" = "%1$[Tipo]@ è %2$[Cartella]@";
"%[Kind]@ is %[images]@ %[all]@" = "%1$[Tipo]@ è %2$[Immagine]@ %3$[Tutti]@";
"%[Kind]@ is %[images]@ %[JPEG]@" = "%1$[Tipo]@ è %2$[Immagine]@ %3$[JPEG]@";
"%[Kind]@ is %[images]@ %[TIFF]@" = "%1$[Tipo]@ è %2$[Immagine]@ %3$[TIFF]@";
"%[Kind]@ is %[images]@ %[GIF]@" = "%1$[Tipo]@ è %2$[Immagine]@ %3$[GIF]@";
"%[Kind]@ is %[images]@ %[PNG]@" = "%1$[Tipo]@ è %2$[Immagine]@ %3$[PNG]@";
"%[Kind]@ is %[images]@ %[BMP]@" = "%1$[Tipo]@ è %2$[Immagine]@ %3$[BMP]@";
"%[Kind]@ is %[music]@ %[all]@" = "%1$[Tipo]@ è %2$[Musica]@ %3$[Tutti]@";
"%[Kind]@ is %[music]@ %[MP3]@" = "%1$[Tipo]@ è %2$[Musica]@ %3$[MP3]@";
"%[Kind]@ is %[music]@ %[AAC]@" = "%1$[Tipo]@ è %2$[Musica]@ %3$[AAC]@";
"%[Kind]@ is %[music]@ %[purchased]@" = "%1$[Tipo]@ è %2$[Musica]@ %3$[Acquistata]@";
"%[Kind]@ is %[PDF]@" = "%1$[Tipo]@ è %2$[PDF]@";
"%[Kind]@ is %[presentations]@" = "%1$[Tipo]@ è %2$[Presentazione]@";
"%[Kind]@ is %[text]@ %[all]@" = "%1$[Tipo]@ è %2$[Testo]@ %3$[Tutti]@";
"%[Kind]@ is %[text]@ %[plain text]@" = "%1$[Tipo]@ è %2$[Testo]@ %3$[Testo normale]@";
"%[Kind]@ is %[text]@ %[rich text]@" = "%1$[Tipo]@ è %2$[Testo]@ %3$[Rich Text]@";
"%[Kind]@ is %[text]@ %[HTML]@" = "%1$[Tipo]@ è %2$[Testo]@ %3$[HTML]@";
"%[Kind]@ is %[text]@ %[XML]@" = "%1$[Tipo]@ è %2$[Testo]@ %3$[XML]@";
"%[Kind]@ is %[text]@ %[source code]@" = "%1$[Tipo]@ è %2$[Testo]@ %3$[Codice sorgente]@";
"%[Kind]@ is %[movies]@" = "%1$[Tipo]@ è %2$[Filmato]@";
"%[Kind]@ is %[other]@ %@" = "%1$[Tipo]@ è %2$[Altro]@ %3$@";

/* date-type attribute template, like kMDItemContentCreationDate */
"%@ is %[within last]@ %@ %[days]@" = "%1$@ è %2$[negli ultimi]@ %3$@ %4$[giorni]@";
"%@ is %[within last]@ %@ %[weeks]@" = "%1$@ è %2$[nelle ultime]@ %3$@ %4$[settimane]@";
"%@ is %[within last]@ %@ %[months]@" = "%1$@ è %2$[negli ultimi]@ %3$@ %4$[mesi]@";
"%@ is %[within last]@ %@ %[years]@" = "%1$@ è %2$[negli ultimi]@ %3$@ %4$[anni]@";
"%@ is %[exactly]@ %@" = "%1$@ %2$[esattamente]@ %3$@";
"%@ is %[before]@ %@" = "%1$@ %2$[prima]@ %3$@";
"%@ is %[after]@ %@" = "%1$@ %2$[dopo]@ %3$@";
"%@ is %[today]@" = "%1$@ è %2$[oggi]@";
"%@ is %[yesterday]@" = "%1$@ è %2$[ieri]@";
"%@ is %[this week]@" = "%1$@ è %2$[questa settimana]@";
"%@ is %[this month]@" = "%1$@ è %2$[questo mese]@";
"%@ is %[this year]@" = "%1$@ è %2$[questo anno]@";

/* string-type attribute, like kMDItemDisplayName */
"%@ %[contains]@ %@" = "%1$@ %2$[contiene]@ %3$@";
"%@ %[begins with]@ %@" = "%1$@ %2$[inizia con]@ %3$@";
"%@ %[ends with]@ %@" = "%1$@ %2$[termina con]@ %3$@";
"%@ %[is]@ %@" = "%1$@ %2$[è]@ %3$@";
"%@ %[matches]@ %@" = "%1$@ %2$[corrisponde]@ %3$@";

/* boolean-type attribute, like kMDItemFlashOnOff */
"%@ %[any]@" = "%1$@ %2$[qualsiasi]@";
"%@ %[yes]@" = "%1$@ %2$[sì]@";
"%@ %[no]@" = "%1$@ %2$[no]@";

/* file visibility */
"%[File invisible]@ %[visible items]@" = "%1$[Visibilità documento]@ %2$[Elementi visibili]@";
"%[File invisible]@ %[invisible items]@" = "%1$[Visibilità documento]@ %2$[Elementi invisibili]@";
"%[File invisible]@ %[visible or invisible]@" = "%1$[Visibilità documento]@ %2$[Visibile o invisibile]@";

/* raw query slice */
"%[Raw query]@ %@" = "%1$[Query semplice]@ %2$@";

/* file extension slice */
"%[File Extension]@ %[is]@ %@" = "%1$[estensione documento]@ %2$[è]@ %3$@";

/* number-type attribute, like kMDItemAudioChannelCount */
"%@ %[equals]@ %@" = "%1$@ %2$[uguale]@ %3$@";
"%@ %[is greater than]@ %@" = "%1$@ %2$[è maggiore di]@ %3$@";
"%@ %[is less than]@ %@" = "%1$@ %2$[è minore di]@ %3$@";
"%@ %[is not]@ %@" = "%1$@ %2$[non è]@ %3$@";

/* text contents */
"%@ contains %@" = "%1$@ contiene %2$@";

/* Byte-sized attributes, such as kMDItemFSSize */
"%@ %[equals]@ %@ %[KB]@" = "%1$@ %2$[uguale]@ %3$@ %4$[KB]@";
"%@ %[equals]@ %@ %[MB]@" = "%1$@ %2$[uguale]@ %3$@ %4$[MB]@";
"%@ %[equals]@ %@ %[GB]@" = "%1$@ %2$[uguale]@ %3$@ %4$[GB]@";
"%@ %[is less than]@ %@ %[KB]@" = "%1$@ %2$[è minore di]@ %3$@ %4$[KB]@";
"%@ %[is less than]@ %@ %[MB]@" = "%1$@ %2$[è minore di]@ %3$@ %4$[MB]@";
"%@ %[is less than]@ %@ %[GB]@" = "%1$@ %2$[è minore di]@ %3$@ %4$[GB]@";
"%@ %[is greater than]@ %@ %[KB]@" = "%1$@ %2$[è maggiore di]@ %3$@ %4$[KB]@";
"%@ %[is greater than]@ %@ %[MB]@" = "%1$@ %2$[è maggiore di]@ %3$@ %4$[MB]@";
"%@ %[is greater than]@ %@ %[GB]@" = "%1$@ %2$[è maggiore di]@ %3$@ %4$[GB]@";
"%@ %[is not]@ %@ %[KB]@" = "%1$@ %2$[non è]@ %3$@ %4$[KB]@";
"%@ %[is not]@ %@ %[MB]@" = "%1$@ %2$[non è]@ %3$@ %4$[MB]@";
"%@ %[is not]@ %@ %[GB]@" = "%1$@ %2$[non è]@ %3$@ %4$[GB]@";

/* Duration-type attributes, such as kMDItemDurationSeconds */
"%@ %[equals]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[uguale]@ %3$@ ore %4$@ minuti %5$@ secondi";
"%@ %[is less than]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[è minore di]@ %3$@ ore %4$@ minuti %5$@ secondi";
"%@ %[is greater than]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[è maggiore di]@ %3$@ ore %4$@ minuti %5$@ secondi";
"%@ %[is not]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[non è]@ %3$@ ore %4$@ minuti %5$@ secondi";

/* This is for the slice that is added when a search string is present in the search field when saving a search. */
"%[Items matching text]@ %@" = "%1$[elementi con testo corrispondente]@ %2$@";

/* Search System Files slice */
"%[SEARCH_SYSTEM_FILES]@ %[YES]@" = "%1$[documenti di sistema]@ %2$[sono inclusi]@";
"%[SEARCH_SYSTEM_FILES]@ %[NO]@" = "%1$[documenti di sistema]@ %2$[non sono inclusi]@";

/* Spotlight items slice */
"%[SEARCH_SPOTLIGHT_ITEMS]@ %[YES]@" = "%1$[elementi di Spotlight]@ %2$[sono inclusi]@";
"%[SEARCH_SPOTLIGHT_ITEMS]@ %[NO]@" = "%1$[elementi di Spotlight]@ %2$[non sono inclusi]@";

